1c_um/src/InformationRegisters/ум_ЗначенияКонстант/ум_ЗначенияКонстант.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ЗначенияКонстант</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ум_Константы</types>
    </type>
  </resources>
  <dimensions>
    <name>Константа</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ум_Константы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/CommonModules/ум_РаботаСКонстантами/Module.bsl
// Описание: получение значения константы
//
// Параметры:
//		Константа - Строка, ПланВидовХарактеристикСсылка.ум_ВидыКонстант - Константа, значение которой небходимо получить
//		Период - Дата, МоментВремени, Граница, Неопределно - момент времени, на который необходимо получить значение константы
//		ЗначениеПоУмолчанию - Произвольный - возвращает если значение по умолчанию если константа не найдена или не заполнена
//											, в случае "Неопределено" - вызывается исключение
// Возвращаемое значение:
//		Характеристика.ум_ВидыКонстант - значение константы
Функция ЗначениеКонстанты(Знач Константа, Период = Неопределено, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Перем Результат;
	
	пвхКонстанта = Неопределено;
	Если ТипЗнч(Константа) = Тип("Строка") Тогда
		пвхКонстанта = ПланыВидовХарактеристик.ум_Константы.НайтиПоРеквизиту("ИмяДляРазработчика", Константа);
		Если НЕ ЗначениеЗаполнено(пвхКонстанта) Тогда
			Если ЗначениеПоУмолчанию = Неопределено Тогда
				ВызватьИсключение "Ошибка получения значения константы: не найдена константа с наименованием """+Константа+"""!";
			Иначе
				Возврат ЗначениеПоУмолчанию; 
			КонецЕсли;
			
		КонецЕсли;
	ИначеЕсли ТипЗнч(Константа) = Тип("ПланВидовХарактеристикСсылка.ум_Константы") Тогда
		пвхКонстанта = Константа;
	Иначе
		 ВызватьИсключение "Ошибка получения значения константы: неожиданный тип значения """+ТипЗнч(Константа)+""" у 1 параметра ""Константа"" при вызове функции ""ум_РаботаСКонстантами.ЗначениеКонстанты()""!";
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ум_ЗначенияКонстантСрезПоследних.Константа КАК Константа,
	|	ум_ЗначенияКонстантСрезПоследних.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ум_ЗначенияКонстант.СрезПоследних(&Период, Константа = &Константа) КАК ум_ЗначенияКонстантСрезПоследних";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Период"		, Период);
	Запрос.УстановитьПараметр("Константа"	, пвхКонстанта);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Если ЗначениеПоУмолчанию = Неопределено Тогда
			ВызватьИсключение "Ошибка получения значения константы: значение константы """+пвхКонстанта+""" не установлено на дату "+ Период +"!";
		Иначе 
			Результат = ЗначениеПоУмолчанию;
		КонецЕсли;
	Иначе
		ВыборкаКонстант = РезультатЗапроса.Выбрать();
		ВыборкаКонстант.Следующий();
		Результат = ВыборкаКонстант.Значение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
